In [1]:
# %load imports.py
import numpy as np
import scipy as sp
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib as mpl
%matplotlib inline
import seaborn as sns
sns.set()

In [2]:
df = pd.DataFrame(
   np.random.randint(0, 20, size=(3,4)),
   columns = ('one', 'two', 'three', 'four'),
    index=('Alpha', 'Beta', 'Gamma'),
)

df

       one  two  three  four
Alpha   18   10      0     8
Beta     5   16     18     1
Gamma   12   12     19    10

In [3]:
labels = ['a', 'b', 'c']
df.index = labels
df

   one  two  three  four
a   18   10      0     8
b    5   16     18     1
c   12   12     19    10

In [4]:
df.set_index('one')

     two  three  four
one
18    10      0     8
5     16     18     1
12    12     19    10

In [5]:
ab = pd.read_csv('../DATA/airport_boardings.csv', thousands=',')
ab.head()

,Airport,Code,2001 Rank,2001 Total,2010 Rank,2010 Total,2011 Rank,Total,Percent change 2001-2011,Percent change 2010-2011
0,"Atlanta, GA (Hartsfield-Jackson Atlanta Intern...",ATL,1,36384264,1,42655392,1,33034788,-9.2,-22.6
1,"Chicago, IL (Chicago O'Hare International)",ORD,2,28626694,2,30033313,2,22367052,-21.9,-25.5
2,"Dallas, TX (Dallas/Fort Worth International)",DFW,3,25198256,3,26785739,3,20430281,-18.9,-23.7
3,"Denver, CO (Denver International)",DEN,6,16397390,4,24965553,4,19190341,17.0,-23.1
4,"Los Angeles, CA (Los Angeles International)",LAX,4,22873307,5,22860849,5,18379418,-19.6,-19.6

In [6]:
ab.set_index('Code', inplace=True)
ab.head()

,Airport,2001 Rank,2001 Total,2010 Rank,2010 Total,2011 Rank,Total,Percent change 2001-2011,Percent change 2010-2011
Code,,,,,,,,,
ATL,"Atlanta, GA (Hartsfield-Jackson Atlanta Intern...",1,36384264,1,42655392,1,33034788,-9.2,-22.6
ORD,"Chicago, IL (Chicago O'Hare International)",2,28626694,2,30033313,2,22367052,-21.9,-25.5
DFW,"Dallas, TX (Dallas/Fort Worth International)",3,25198256,3,26785739,3,20430281,-18.9,-23.7
DEN,"Denver, CO (Denver International)",6,16397390,4,24965553,4,19190341,17.0,-23.1
LAX,"Los Angeles, CA (Los Angeles International)",4,22873307,5,22860849,5,18379418,-19.6,-19.6

In [7]:
x = ab.index
print(type(x))
print(len(x))
print(x[0])

<class 'pandas.core.indexes.base.Index'>
50
ATL

In [8]:
df = pd.DataFrame(
   np.random.randint(0, 20, size=(3,4)),
   columns = ('one', 'two', 'three', 'four'),
    index=('Alpha', 'Beta', 'Gamma'),
)

df

       one  two  three  four
Alpha    0   10     11    12
Beta     5   14     12    15
Gamma    7    3     16    10

In [9]:
df.insert(0, 'zero', df['four'], allow_duplicates=True)
df.drop('four', axis=1, inplace=True)

In [33]:
df

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Order Year
0,Central America and the Caribbean,Antigua and Barbuda,Baby Food,Online,M,2013-12-20,957081544,2014-01-11,552,255.28,159.42,2013
1,Central America and the Caribbean,Panama,Snacks,Offline,C,2010-07-05,301644504,2010-07-26,2167,152.58,97.44,2010
2,Europe,Czech Republic,Beverages,Offline,C,2011-09-12,478051030,2011-09-29,4778,47.45,31.79,2011
3,Asia,North Korea,Cereal,Offline,L,2010-05-13,892599952,2010-06-15,9016,205.70,117.11,2010
4,Asia,Sri Lanka,Snacks,Offline,C,2015-07-20,571902596,2015-07-27,7542,152.58,97.44,2015
...,...,...,...,...,...,...,...,...,...,...,...,...
4995,Australia and Oceania,New Zealand,Household,Offline,C,2015-04-03,217984473,2015-04-20,5305,668.27,502.54,2015
4996,Middle East and North Africa,Azerbaijan,Clothes,Offline,L,2014-08-17,169748055,2014-10-02,1077,109.28,35.84,2014
4997,Asia,Myanmar,Baby Food,Offline,H,2016-11-23,226939189,2016-12-10,5204,255.28,159.42,2016
4998,Europe,Finland,Clothes,Online,L,2014-04-22,906794202,2014-05-11,9410,109.28,35.84,2014
4999,Sub-Saharan Africa,Tanzania,Vegetables,Online,L,2011-07-08,996861922,2011-08-07,2450,154.06,90.93,2011

In [43]:
df.head()
df.query('Region == "Europe"')
df.loc[df['Region'] == "Europe"]

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Order Year
2,Europe,Czech Republic,Beverages,Offline,C,2011-09-12,478051030,2011-09-29,4778,47.45,31.79,2011
7,Europe,Bosnia and Herzegovina,Clothes,Online,M,2013-10-14,919133651,2013-11-04,927,109.28,35.84,2013
16,Europe,Austria,Cereal,Offline,C,2014-08-13,987410676,2014-09-06,5616,205.70,117.11,2014
17,Europe,Bulgaria,Office Supplies,Online,L,2010-10-31,672330081,2010-11-29,6266,651.21,524.96,2010
22,Europe,Estonia,Fruits,Online,L,2016-09-28,579463422,2016-11-01,4958,9.33,6.92,2016
...,...,...,...,...,...,...,...,...,...,...,...,...
4987,Europe,Norway,Personal Care,Offline,M,2014-01-14,634033286,2014-01-15,3394,81.73,56.67,2014
4990,Europe,Ukraine,Cereal,Offline,L,2014-04-14,559183347,2014-05-21,3633,205.70,117.11,2014
4991,Europe,Armenia,Meat,Offline,M,2015-11-09,781416594,2015-12-23,7390,421.89,364.69,2015
4993,Europe,Denmark,Clothes,Offline,H,2012-05-09,713357150,2012-06-03,7088,109.28,35.84,2012
4998,Europe,Finland,Clothes,Online,L,2014-04-22,906794202,2014-05-11,9410,109.28,35.84,2014

In [11]:
df = pd.DataFrame(
   np.random.randint(0, 20, size=(3,4)),
   columns = ('one', 'two', 'three', 'four'),
    index=('Alpha', 'Beta', 'Gamma'),
)

df

       one  two  three  four
Alpha    8    4     13    15
Beta    16   11     16     5
Gamma    8   16     17    19

In [12]:
df.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [13]:
type(df.columns)

pandas.core.indexes.base.Index

In [15]:
c = df.columns
print(c.inferred_type)

string

In [16]:
r = df.index
r

Index(['Alpha', 'Beta', 'Gamma'], dtype='object')

In [17]:
r.inferred_type

'string'

In [18]:
df.index = [1, 2, 3]
df

   one  two  three  four
1    8    4     13    15
2   16   11     16     5
3    8   16     17    19

In [19]:
df.index.inferred_type

'integer'

In [20]:
df.index = pd.date_range('2023-01-01', periods=3, freq="D")
df

            one  two  three  four
2023-01-01    8    4     13    15
2023-01-02   16   11     16     5
2023-01-03    8   16     17    19

In [21]:
d = pd.date_range('2023-01-01', periods=50, freq='H')
d

DatetimeIndex(['2023-01-01 00:00:00', '2023-01-01 01:00:00',
               '2023-01-01 02:00:00', '2023-01-01 03:00:00',
               '2023-01-01 04:00:00', '2023-01-01 05:00:00',
               '2023-01-01 06:00:00', '2023-01-01 07:00:00',
               '2023-01-01 08:00:00', '2023-01-01 09:00:00',
               '2023-01-01 10:00:00', '2023-01-01 11:00:00',
               '2023-01-01 12:00:00', '2023-01-01 13:00:00',
               '2023-01-01 14:00:00', '2023-01-01 15:00:00',
               '2023-01-01 16:00:00', '2023-01-01 17:00:00',
               '2023-01-01 18:00:00', '2023-01-01 19:00:00',
               '2023-01-01 20:00:00', '2023-01-01 21:00:00',
               '2023-01-01 22:00:00', '2023-01-01 23:00:00',
               '2023-01-02 00:00:00', '2023-01-02 01:00:00',
               '2023-01-02 02:00:00', '2023-01-02 03:00:00',
               '2023-01-02 04:00:00', '2023-01-02 05:00:00',
               '2023-01-02 06:00:00', '2023-01-02 07:00:00',
               '2023-01-02 08:00:00', '2023-01-02 09:00:00',
               '2023-01-02 10:00:00', '2023-01-02 11:00:00',
               '2023-01-02 12:00:00', '2023-01-02 13:00:00',
               '2023-01-02 14:00:00', '2023-01-02 15:00:00',
               '2023-01-02 16:00:00', '2023-01-02 17:00:00',
               '2023-01-02 18:00:00', '2023-01-02 19:00:00',
               '2023-01-02 20:00:00', '2023-01-02 21:00:00',
               '2023-01-02 22:00:00', '2023-01-02 23:00:00',
               '2023-01-03 00:00:00', '2023-01-03 01:00:00'],
              dtype='datetime64[ns]', freq='H')

In [22]:
# d.resample("5H")

In [23]:
ti = pd.read_csv('../DATA/titanic3.csv')
ti

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [24]:
pd.pivot_table(ti[['age', 'survived', 'sex', 'pclass']], index=['sex', 'pclass'], aggfunc={'age': [np.min, np.mean, np.max], 'survived': np.sum})

/var/folders/p7/_ryqngjd3jn_ppndvnhdzqch0000gn/T/ipykernel_1047/1783405730.py:1: FutureWarning: The provided callable <function min at 0x113919260> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  pd.pivot_table(ti[['age', 'survived', 'sex', 'pclass']], index=['sex', 'pclass'], aggfunc={'age': [np.min, np.mean, np.max], 'survived': np.sum})
/var/folders/p7/_ryqngjd3jn_ppndvnhdzqch0000gn/T/ipykernel_1047/1783405730.py:1: FutureWarning: The provided callable <function mean at 0x113919b20> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.pivot_table(ti[['age', 'survived', 'sex', 'pclass']], index=['sex', 'pclass'], aggfunc={'age': [np.min, np.mean, np.max], 'survived': np.sum})
/var/folders/p7/_ryqngjd3jn_ppndvnhdzqch0000gn/T/ipykernel_1047/1783405730.py:1: FutureWarning: The provided callable <function max at 0x113919120> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  pd.pivot_table(ti[['age', 'survived', 'sex', 'pclass']], index=['sex', 'pclass'], aggfunc={'age': [np.min, np.mean, np.max], 'survived': np.sum})
/var/folders/p7/_ryqngjd3jn_ppndvnhdzqch0000gn/T/ipykernel_1047/1783405730.py:1: FutureWarning: The provided callable <function sum at 0x113918a40> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pd.pivot_table(ti[['age', 'survived', 'sex', 'pclass']], index=['sex', 'pclass'], aggfunc={'age': [np.min, np.mean, np.max], 'survived': np.sum})

                age                    survived
                max       mean     min      sum
sex    pclass
female 1       76.0  37.037594  2.0000      139
       2       60.0  27.499191  0.9167       94
       3       63.0  22.185307  0.1667      106
male   1       80.0  41.029250  0.9167       61
       2       70.0  30.815401  0.6667       25
       3       74.0  25.962273  0.3333       75

In [25]:
df = pd.read_csv("../DATA/sales_records.csv", parse_dates=['Order Date', 'Ship Date'])
df

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost
0,Central America and the Caribbean,Antigua and Barbuda,Baby Food,Online,M,2013-12-20,957081544,2014-01-11,552,255.28,159.42
1,Central America and the Caribbean,Panama,Snacks,Offline,C,2010-07-05,301644504,2010-07-26,2167,152.58,97.44
2,Europe,Czech Republic,Beverages,Offline,C,2011-09-12,478051030,2011-09-29,4778,47.45,31.79
3,Asia,North Korea,Cereal,Offline,L,2010-05-13,892599952,2010-06-15,9016,205.70,117.11
4,Asia,Sri Lanka,Snacks,Offline,C,2015-07-20,571902596,2015-07-27,7542,152.58,97.44
...,...,...,...,...,...,...,...,...,...,...,...
4995,Australia and Oceania,New Zealand,Household,Offline,C,2015-04-03,217984473,2015-04-20,5305,668.27,502.54
4996,Middle East and North Africa,Azerbaijan,Clothes,Offline,L,2014-08-17,169748055,2014-10-02,1077,109.28,35.84
4997,Asia,Myanmar,Baby Food,Offline,H,2016-11-23,226939189,2016-12-10,5204,255.28,159.42
4998,Europe,Finland,Clothes,Online,L,2014-04-22,906794202,2014-05-11,9410,109.28,35.84
4999,Sub-Saharan Africa,Tanzania,Vegetables,Online,L,2011-07-08,996861922,2011-08-07,2450,154.06,90.93

In [26]:
df["Order Year"] = df['Order Date'].dt.year
df

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Order Year
0,Central America and the Caribbean,Antigua and Barbuda,Baby Food,Online,M,2013-12-20,957081544,2014-01-11,552,255.28,159.42,2013
1,Central America and the Caribbean,Panama,Snacks,Offline,C,2010-07-05,301644504,2010-07-26,2167,152.58,97.44,2010
2,Europe,Czech Republic,Beverages,Offline,C,2011-09-12,478051030,2011-09-29,4778,47.45,31.79,2011
3,Asia,North Korea,Cereal,Offline,L,2010-05-13,892599952,2010-06-15,9016,205.70,117.11,2010
4,Asia,Sri Lanka,Snacks,Offline,C,2015-07-20,571902596,2015-07-27,7542,152.58,97.44,2015
...,...,...,...,...,...,...,...,...,...,...,...,...
4995,Australia and Oceania,New Zealand,Household,Offline,C,2015-04-03,217984473,2015-04-20,5305,668.27,502.54,2015
4996,Middle East and North Africa,Azerbaijan,Clothes,Offline,L,2014-08-17,169748055,2014-10-02,1077,109.28,35.84,2014
4997,Asia,Myanmar,Baby Food,Offline,H,2016-11-23,226939189,2016-12-10,5204,255.28,159.42,2016
4998,Europe,Finland,Clothes,Online,L,2014-04-22,906794202,2014-05-11,9410,109.28,35.84,2014
4999,Sub-Saharan Africa,Tanzania,Vegetables,Online,L,2011-07-08,996861922,2011-08-07,2450,154.06,90.93,2011

In [27]:
pt = df[["Item Type", "Country", "Unit Price"]].pivot_table(index="Item Type", columns="Country", aggfunc="min")
pt

                 Unit Price                                  \
Country         Afghanistan Albania Algeria Andorra  Angola
Item Type
Baby Food            255.28  255.28  255.28  255.28  255.28
Beverages               NaN   47.45   47.45   47.45     NaN
Cereal               205.70     NaN  205.70  205.70     NaN
Clothes              109.28  109.28  109.28  109.28  109.28
Cosmetics               NaN  437.20     NaN  437.20  437.20
Fruits                 9.33     NaN    9.33    9.33    9.33
Household            668.27  668.27     NaN  668.27  668.27
Meat                 421.89  421.89  421.89  421.89     NaN
Office Supplies      651.21  651.21     NaN  651.21  651.21
Personal Care         81.73     NaN   81.73   81.73     NaN
Snacks               152.58  152.58  152.58  152.58  152.58
Vegetables           154.06  154.06  154.06  154.06  154.06

                                                                           \
Country         Antigua and Barbuda  Armenia Australia Austria Azerbaijan
Item Type
Baby Food                     255.28  255.28    255.28     NaN     255.28
Beverages                      47.45   47.45     47.45   47.45      47.45
Cereal                        205.70  205.70    205.70  205.70        NaN
Clothes                       109.28  109.28    109.28  109.28     109.28
Cosmetics                     437.20     NaN    437.20  437.20     437.20
Fruits                          9.33    9.33      9.33    9.33       9.33
Household                     668.27  668.27    668.27  668.27     668.27
Meat                          421.89  421.89       NaN  421.89     421.89
Office Supplies                  NaN  651.21    651.21  651.21     651.21
Personal Care                  81.73   81.73     81.73   81.73      81.73
Snacks                        152.58  152.58    152.58  152.58     152.58
Vegetables                       NaN  154.06    154.06  154.06     154.06

                 ...                                      \
Country          ... United Arab Emirates United Kingdom
Item Type        ...
Baby Food        ...               255.28         255.28
Beverages        ...                47.45          47.45
Cereal           ...                  NaN         205.70
Clothes          ...               109.28         109.28
Cosmetics        ...               437.20         437.20
Fruits           ...                 9.33           9.33
Household        ...               668.27         668.27
Meat             ...               421.89            NaN
Office Supplies  ...                  NaN         651.21
Personal Care    ...                81.73          81.73
Snacks           ...                  NaN         152.58
Vegetables       ...                  NaN         154.06

                                                                          \
Country         United States of America Uzbekistan Vanuatu Vatican City
Item Type
Baby Food                         255.28     255.28     NaN       255.28
Beverages                          47.45      47.45   47.45        47.45
Cereal                            205.70     205.70  205.70       205.70
Clothes                           109.28     109.28  109.28       109.28
Cosmetics                         437.20     437.20  437.20       437.20
Fruits                              9.33       9.33    9.33         9.33
Household                         668.27     668.27  668.27       668.27
Meat                              421.89     421.89  421.89       421.89
Office Supplies                   651.21     651.21  651.21       651.21
Personal Care                      81.73      81.73   81.73        81.73
Snacks                            152.58     152.58  152.58       152.58
Vegetables                        154.06        NaN  154.06       154.06


Country         Vietnam   Yemen  Zambia Zimbabwe
Item Type
Baby Food        255.28  255.28  255.28   255.28
Beverages         47.45   47.45   47.45    47.45
Cereal           205.70  205.70  205.70   205.70
Clothes          109.28  109.28  109.28   109.28
Cosmetics           NaN  437.20  437.20      NaN
Fruits             9.33    9.33     NaN     9.33
Household        668.27  668.27  668.27   668.27
Meat             421.89     NaN  421.89   421.89
Office Supplies  651.21  651.21  651.21   651.21
Personal Care       NaN   81.73   81.73      NaN
Snacks              NaN  152.58  152.58   152.58
Vegetables       154.06  154.06  154.06   154.06

[12 rows x 185 columns]

In [28]:
gb = pt = df[["Item Type", "Country", "Units Sold"]].groupby('Item Type').agg("min")
gb

                     Country  Units Sold
Item Type
Baby Food        Afghanistan           2
Beverages            Albania           4
Cereal           Afghanistan          50
Clothes          Afghanistan           2
Cosmetics            Albania          17
Fruits           Afghanistan           7
Household        Afghanistan           2
Meat             Afghanistan          17
Office Supplies  Afghanistan           2
Personal Care    Afghanistan          20
Snacks           Afghanistan          40
Vegetables       Afghanistan           9

In [29]:
pt = df[["Item Type", "Order Year", "Region", "Units Sold"]].pivot_table(index=['Order Year'], columns="Region",  aggfunc="mean")
pt

TypeError: agg function failed [how->mean,dtype->object]

In [ ]:
pt = df[["Order Year", "Units Sold"]].pivot_table(index="Order Year", aggfunc=["min", "max", "mean", "median"])
pt

In [ ]:
chi = pd.read_csv('../DATA/city-of-chicago-salaries.csv')
chi.columns = 'name position department salary'.split()
chi

Convert salary column from string to float after removing leading '$'.

In [ ]:
chi['salary'] = chi['salary'].str[1:].astype(float)
chi

Calculate average salary per department

In [ ]:
pt = chi[["department", "position", "salary"]].pivot_table(index=["department", "position"]).sort_values(by=["department", "salary"])
pt

In [ ]:
pt.loc['POLICE'].loc['POLICE CADET']